const BUSINESS_CUSTOMER_DEPARTMENT_MAPPING = {
  "Группа контролера профессионального участника рынка ценных бумаг": [
    "Группа контролера профессионального участника рынка ценных бумаг"
  ],
  "Группа по развитию и координации международного бизнеса": [
    "Группа по развитию и координации международного бизнеса"
  ],
  "Департамент ИТ-архитектуры": [
    "Департамент ИТ-архитектуры"
  ],
  "Департамент администрирования региональной сети": [
    "Департамент администрирования региональной сети"
  ],
  "Департамент администрирования сети": [
    "Департамент администрирования сети"
  ],
  "Департамент анализа данных и моделирования": [
    "Департамент анализа данных и моделирования"
  ],
  "Департамент анализа, координации и продуктового развития": [
    "Департамент анализа, координации и продуктового развития"
  ],
  "Департамент андеррайтинга": [
    "Департамент андеррайтинга"
  ],
  "Департамент брокерского обслуживания ": [
    "Департамент брокерского обслуживания "
  ],
  "Департамент залогов": [
    "Департамент залогов"
  ],
  "Департамент инвестиционных продуктов ": [
    "Департамент инвестиционных продуктов "
  ],
  "Департамент интегрированного управления рисками": [
    "Департамент интегрированного управления рисками",
    "Департамент интегрированного управления рисками_Управление консолидированного анализа рисков",
    "Департамент интегрированного управления рисками_Управление операционных рисков",
    "Департамент интегрированного управления рисками_Управление развития риск-технологий и процессов",
    "Департамент интегрированного управления рисками_Управление рыночных рисков"
  ],
  "Департамент клиентского обслуживания": [
    "Департамент клиентского обслуживания"
  ],
  "Департамент комплаенс-контроля и финансового мониторинга": [
    "Департамент комплаенс-контроля и финансового мониторинга"
  ],
  "Департамент координации и анализа бизнеса ": [
    "Департамент координации и анализа бизнеса "
  ],
  "Департамент корпоративных кредитных рисков": [
    "Департамент корпоративных кредитных рисков",
    "Департамент корпоративных кредитных рисков_Управление анализа кредитных рисков КИБ",
    "Департамент корпоративных кредитных рисков_Управление анализа рисков финансирования проектов и финансовых компаний",
    "Департамент корпоративных кредитных рисков_Управление портфельного анализа",
    "Департамент корпоративных кредитных рисков_Управление развития кредитных процедур"
  ],
  "Департамент кредитного розничного бизнеса": [
    "Департамент кредитного розничного бизнеса",
    "Департамент кредитного розничного бизнеса_Управление \"Автокредитование\"",
    "Департамент кредитного розничного бизнеса_Управление \"Альтернативное кредитование\"",
    "Департамент кредитного розничного бизнеса_Управление \"Ипотечное кредитование\"",
    "Департамент кредитного розничного бизнеса_Управление координации и поддержки кредитных продуктов",
    "Департамент кредитного розничного бизнеса_Управление \"Кредитные карты\"",
    "Департамент кредитного розничного бизнеса_Управление \"Потребительское кредитование\"",
    "Департамент кредитного розничного бизнеса_Управление \"Общекредитные процессы и сервисы\"",
    "Департамент кредитного розничного бизнеса_Управление \"Страхование\""
  ],
  "Департамент маркетинга и рекламы": [
    "Департамент маркетинга и рекламы"
  ],
  "Департамент непрофильных и проблемных активов": [
    "Департамент непрофильных и проблемных активов"
  ],
  "Департамент непрофильных активов": [
    "Департамент непрофильных активов"
  ],
  "Департамент операций на рынке акций ": [
    "Департамент операций на рынке акций "
  ],
  "Департамент операционной модели цифрового развития": [
    "Департамент операционной модели цифрового развития",
    "Департамент операционной модели цифрового развития"
  ],
  "Департамент операционной поддержки бизнеса": [
    "Департамент операционной поддержки бизнеса",
    "Департамент операционной поддержки бизнеса_Управление валютного контроля и банковского сопровождения",
    "Департамент операционной поддержки бизнеса_Управление инфраструктуры налично-денежного обращения",
    "Департамент операционной поддержки бизнеса_Управление качества учетно-операционных данных",
    "Департамент операционной поддержки бизнеса_Управление кредитных и документарных операций физических лиц",
    "Департамент операционной поддержки бизнеса_Управление кредитных и документарных операций юридических лиц",
    "Департамент операционной поддержки бизнеса_Управление операционного контроля и хранения документов",
    "Департамент операционной поддержки бизнеса_Управление организации операционного производства",
    "Департамент операционной поддержки бизнеса_Управление платежных продуктов и систем",
    "Департамент операционной поддержки бизнеса_Управление поддержки инвестиционного бизнеса",
    "Департамент операционной поддержки бизнеса_Управление \"Развитие технологий эквайринга\"",
    "Департамент операционной поддержки бизнеса_Управление \"Расчетный центр\"",
    "Департамент операционной поддержки бизнеса_Управление региональных операционных сервисов",
    "Департамент операционной поддержки бизнеса_Управление сопровождения запросов и взысканий",
    "Департамент операционной поддержки бизнеса_Управление сопровождения карточных операций",
    "Департамент операционной поддержки бизнеса_Управление сопровождения кредитов КИБ и документарных операций КИБ и СМБ",
    "Департамент операционной поддержки бизнеса_Управление сопровождения кредитов СМБ",
    "Департамент операционной поддержки бизнеса_Управление транзакционных операций физических лиц",
    "Департамент операционной поддержки бизнеса_Управление транзакционных операций юридических лиц"
  ],
  "Департамент организации и контроля технологического развития": [
    "Департамент организации и контроля технологического развития"
  ],
  "Департамент партнерств": [
    "Департамент партнерств",
    "Департамент партнерств_Управление развития партнерств"
  ],
  "Департамент по обеспечению безопасности": [
    "Департамент по обеспечению безопасности"
  ],
  "Департамент по работе с клиентами базовых отраслей": [
    "Департамент по работе с клиентами базовых отраслей"
  ],
  "Департамент по работе с клиентами рыночных отраслей ": [
    "Департамент по работе с клиентами рыночных отраслей "
  ],
  "Департамент по работе с массовым сегментом": [
    "Департамент по работе с массовым сегментом"
  ],
  "Департамент по работе с обращениями клиентов": [
    "Департамент по работе с обращениями клиентов"
  ],
  "Департамент по работе с персоналом": [
    "Департамент по работе с персоналом"
  ],
  "Департамент по работе с премиальными клиентами": [
    "Департамент по работе с премиальными клиентами",
    "Департамент по работе с премиальными клиентами_Управление по работе с премиальными клиентами",
    "Департамент по работе с премиальными клиентами_Управление по работе с состоятельными клиентами",
    "Департамент по работе с премиальными клиентами_Управление по развитию и администрированию бизнеса",
    "Департамент по работе с премиальными клиентами_Управление продаж инвестиционных продуктов",
    "Департамент по работе с премиальными клиентами_Управление проектной деятельности и аналитической поддержки",
    "Департамент по работе с премиальными клиентами_Управление \"Состоятельные клиенты\"",
    "Департамент по работе с премиальными клиентами_Дирекция привлечения и цифрового развития клиентов"
  ],
  "Департамент по работе с состоятельными клиентами": [
    "Департамент по работе с состоятельными клиентами"
  ],
  "Департамент по работе со СМИ": [
    "Департамент по работе со СМИ"
  ],
  "Департамент поддержки прикладных систем и сервисов": [
    "Департамент поддержки прикладных систем и сервисов"
  ],
  "Департамент продаж в партнерских каналах": [
    "Департамент продаж в партнерских каналах"
  ],
  "Департамент продаж продуктов финансовых рынков": [
    "Департамент продаж продуктов финансовых рынков"
  ],
  "Департамент развития инструментов обслуживания": [
    "Департамент развития инструментов обслуживания"
  ],
  "Департамент развития инфраструктуры": [
    "Департамент развития инфраструктуры"
  ],
  "Департамент развития клиентского сервиса": [
    "Департамент развития клиентского сервиса"
  ],
  "Департамент развития клиентской базы": [
    "Департамент развития клиентской базы",
    "Департамент развития клиентской базы_Управление CRM кампаний",
    "Департамент развития клиентской базы_Управление \"Клиент 360\"",
    "Департамент развития клиентской базы_Управление \"Розничный клиент\"",
    "Департамент развития клиентской базы_Управление \"Технологии продаж и продвижения\"",
    "Департамент развития клиентской базы_Управление дистанционных продаж",
    "Департамент развития клиентской базы_Управление продаж и развития клиентской базы",
    "Департамент развития клиентской базы_Управление развития коммерческих компетенций"
  ],
  "Департамент развития международных расчетов": [
    "Департамент развития международных расчетов"
  ],
  "Департамент розничного CRM": [
    "Департамент розничного CRM"
  ],
  "Департамент розничного бизнеса": [
    "Департамент розничного бизнеса"
  ],
  "Департамент розничных кредитных рисков": [
    "Департамент розничных кредитных рисков",
    "Департамент розничных кредитных рисков_Управление количественной оценки рисков",
    "Департамент розничных кредитных рисков_Управление методологии",
    "Департамент розничных кредитных рисков_Управление портфельного анализа",
    "Департамент розничных кредитных рисков_Управление развития процессов и технологий",

    // Старые значения, которые могли остаться у моделей. После проверки данных на прод-стенде, нужно удалить.
    "ДРКР",
    "ДРКР, Управление количественной оценки рисков",
    "ДРКР_Департамент рисков ЗАО Банк ВТБ (Армения)",
    "ДРКР_Департамент розничного бизнеса АО «Саровбизнесбанк»",
    "ДРКР_Отдел розничных кредитных рисков Управления розничных кредитных рисков Департамента рисков",
    "ДРКР_УКОР",
    "ДРКР_Управление Рисков Автолизинга Департамента Рисков АО ВТБ Лизинг",
    "ДРКР_Управление рисков ВТБ Беларусь",
    "Управление количественной оценки рисков Департамент розничных кредитных рисков"
  ],
  "Департамент розничных продаж": [
    "Департамент розничных продаж"
  ],
  "Департамент розничных продуктов": [
    "Департамент розничных продуктов"
  ],
  "Департамент сбережений и зачислений": [
    "Департамент сбережений и зачислений",
    "Департамент сбережений и зачислений_Управление \"Государственные услуги\"",
    "Департамент сбережений и зачислений_Управление \"Зарплатные проекты\"",
    "Департамент сбережений и зачислений_Управление \"Сбережения\"",
    "Департамент сбережений и зачислений_Управление \"Старшее поколение\"",
    "Департамент сбережений и зачислений_Управление экспертизы и поддержки процессов"
  ],
  "Департамент стратегии и корпоративного развития": [
    "Департамент стратегии и корпоративного развития",
    "Департамент стратегии и корпоративного развития_Управление корпоративного развития",
    "Департамент стратегии и корпоративного развития_Управление стратегии",
    "Департамент стратегии и корпоративного развития_Управление стратегических проектов",
    "Департамент стратегии и корпоративного развития_Управление \"Центр качества клиентского опыта\""
  ],
  "Департамент структурных продуктов и структурирования": [
    "Департамент структурных продуктов и структурирования"
  ],
  "Департамент технологического развития корпоративного бизнеса": [
    "Департамент технологического развития корпоративного бизнеса"
  ],
  "Департамент технологического развития общебанковских систем": [
    "Департамент технологического развития общебанковских систем"
  ],
  "Департамент технологического развития розничного бизнеса": [
    "Департамент технологического развития розничного бизнеса"
  ],
  "Департамент технологического развития систем поддержки бизнеса": [
    "Департамент технологического развития систем поддержки бизнеса"
  ],
  "Департамент транзакционного бизнеса ": [
    "Департамент транзакционного бизнеса "
  ],
  "Департамент транзакционного розничного бизнеса ": [
    "Департамент транзакционного розничного бизнеса "
  ],
  "Департамент управления и координации технологических изменений": [
    "Департамент управления и координации технологических изменений"
  ],
  "Департамент учета и отчетности": [
    "Департамент учета и отчетности"
  ],
  "Департамент эквайринга": [
    "Департамент эквайринга"
  ],
  "Депозитарий ": [
    "Депозитарий "
  ],
  "Дочерняя компания": [
    "Дочерняя компания"
  ],
  "Казначейство": [
    "Казначейство"
  ],
  "Кредитный департамент ": [
    "Кредитный департамент "
  ],
  "Специальный отдел": [
    "Специальный отдел"
  ],
  "Управление «Автокредитование»": [
    "Управление «Автокредитование»"
  ],
  "Управление «Дебетовые карты и счета»": [
    "Управление «Дебетовые карты и счета»"
  ],
  "Управление «Зарплатные проекты»": [
    "Управление «Зарплатные проекты»"
  ],
  "Управление «Ипотечное кредитование»": [
    "Управление «Ипотечное кредитование»"
  ],
  "Управление «Кредитные карты": [
    "Управление «Кредитные карты"
  ],
  "Управление «Потребительское кредитование»": [
    "Управление «Потребительское кредитование»"
  ],
  "Управление «Программы лояльности»": [
    "Управление «Программы лояльности»"
  ],
  "Управление «Сбережения»": [
    "Управление «Сбережения»"
  ],
  "Управление «Центр инноваций»": [
    "Управление «Центр инноваций»"
  ],
  "Управление «Центр качества клиентского опыта»": [
    "Управление «Центр качества клиентского опыта»"
  ],
  "Управление координации и развития бизнеса в дочерних компаниях": [
    "Управление координации и развития бизнеса в дочерних компаниях"
  ],
  "Управление координации стратегических проектов по фондированию и лояльности": [
    "Управление координации стратегических проектов по фондированию и лояльности"
  ],
  "Управление координации строительных проектов ": [
    "Управление координации строительных проектов "
  ],
  "Управление корпоративной социальной ответственности и событийного маркетинга": [
    "Управление корпоративной социальной ответственности и событийного маркетинга"
  ],
  "Управление модельных рисков и валидации": [
    "Управление модельных рисков и валидации"
  ],
  "Управление продаж в корпоративном канале": [
    "Управление продаж в корпоративном канале"
  ],
  "Управление развития розничного бизнеса в дочерних компаниях": [
    "Управление развития розничного бизнеса в дочерних компаниях"
  ],
  "Управление сопровождения маркетинга и коммуникаций": [
    "Управление сопровождения маркетинга и коммуникаций"
  ],
  "Управление структурных продуктов и структурирования": [
    "Управление структурных продуктов и структурирования"
  ],
  "Управление экспертизы и фрод-мониторинга": [
    "Управление экспертизы и фрод-мониторинга"
  ],
  "Финансовый департамент": [
    "Финансовый департамент"
  ],
  "Юридический департамент": [
    "Юридический департамент"
  ],
  "Административный департамент": [
    "Административный департамент"
  ],
  "Аппарат президента – председателя правления": [
    "Аппарат президента – председателя правления"
  ],
  "Департамент корпоративного цифрового бизнеса": [
    "Департамент корпоративного цифрового бизнеса"
  ],
  "Департамент кредитования регионального бизнеса": [
    "Департамент кредитования регионального бизнеса"
  ],
  "Департамент развития и координации розничного бизнеса": [
    "Департамент развития и координации розничного бизнеса",
    "Департамент развития и координации розничного бизнеса_Управление бизнес-аналитики",
    "Департамент развития и координации розничного бизнеса_Управление методологической поддержки",
    "Департамент развития и координации розничного бизнеса_Управление проектов розничного бизнеса",
    "Департамент развития и координации розничного бизнеса_Управление планирования и отчетности",
    "Департамент развития и координации розничного бизнеса_Управление развития розничного бизнеса в дочерних компаниях",
    "Департамент развития и координации розничного бизнеса_Управление стратегического развития и мониторинга"
  ],
  "Департамент регионального корпоративного бизнеса": [
    "Департамент регионального корпоративного бизнеса"
  ],
  "Департамент финансового урегулирования": [
    "Департамент финансового урегулирования"
  ],
  "Департамент цифрового бизнеса": [
    "Департамент цифрового бизнеса"
  ],
  "Управление обслуживания приоритетных клиентов": [
    "Управление обслуживания приоритетных клиентов"
  ],
  "Управление по работе с залоговыми активами и урегулирования задолженности": [
    "Управление по работе с залоговыми активами и урегулирования задолженности"
  ],
  "Управление специального информационного обеспечения": [
    "Управление специального информационного обеспечения"
  ],
  "Департамент внутреннего аудита": [
    "Департамент внутреннего аудита"
  ],
  "Тестовый департамент": [
    "Тестовый департамент map"
  ]
}

/**
 * Maps the current business customer department values to their corresponding mapped values.
 * - Trims each department name.
 * - Replaces each department using BUSINESS_CUSTOMER_DEPARTMENT_MAPPING, if a mapping exists.
 * - Flattens the result in case the mapping contains multiple values.
 * - Removes duplicates.
 *
 * @param {string[]} currentDepartments - An array of department names from Keycloak.
 * @returns {string[]} - An array of unique mapped department names.
 */
function mapBusinessCustomerDepartments(currentDepartments) {
  if (!Array.isArray(currentDepartments) || currentDepartments.length === 0) {
    return [];
  }

  const mappedDepartments = currentDepartments
    .map(dep => dep.trim())
    .flatMap(dep => BUSINESS_CUSTOMER_DEPARTMENT_MAPPING[dep] || dep);

  return [...new Set(mappedDepartments)]; // Remove duplicates
}

module.exports = {
  mapBusinessCustomerDepartments
}
